<template>
    <div class="page" style="opacity: 1">
        <h2>微店平台用户协议</h2>
        <div class="con">
            <p>本协议由同意并承诺遵守本协议规定使用微店网服务的法律实体（下称“商户”或“甲方”）、微店网及其关联公司深圳市云商微店网络技术有限公司（下称“乙方”），本协议具有合同效力。</p>
            <h3>一、协议内容及生效：</h3>
            <p>（一）本协议内容包括协议正文及所有微店网已经发布的或将来可能发布的各类规则。所有规则为协议不可分割的一部分，与协议正文具有同等法律效力。</p>
            <p>（二）商户在使用微店网提供的各项服务的同时，承诺接受并遵守各项相关规则的规定。微店网有权根据需要不时地制定、修改本协议或各类规则，如本协议有任何变更，微店网将在网站上以公示形式通知予商户。如商户不同意相关变更，必须立即以书面通知的方式终止本协议。任何修订和新规则一经公布即自动生效，成为本协议的一部分。登录或继续使用服务将表示商户接受经修订的协议。除另行明确声明外，任何使服务范围扩大或功能增强的新内容均受本协议约束。</p>
            <p>（三）商户签署或在线接受本协议并不导致本协议立即生效，经过微店网审核通过并向商户发出服务开通通知时，本协议即在商户和微店网之间产生法律效力。</p>
            <h3>二、证明文件提交：</h3>
            <p>（一）证明文件提交：商户欲使用本协议下服务，必须向微店网或微店网指定合作方提交其在申请服务时应当提供的证明文件或其他相关证明。</p>
            <p>（二）微店网将对商户的证明文件进行不定时的抽查，有权要求商户提供更多证明文件，商户需按微店网要求提供。如商户不能提供，则微店网有权立即终止或中止本协议。</p>
            <p>（三）责任条款：商户同意为其未及时的通知或更新其证明文件或其他证明信息承担全部责任，商户保证其向微店网提供的全部证明文件真实、准确且不存在超过时效问题（即保证所有证明文件在整个合同履行期间都处于有效期内）如因上述原因发生纠纷或被相关国家主管机关处罚，商户应当独立承担全部责任，如给微店网（包括其合作伙伴、代理人、职员等）造成损失的，商户同意赔偿其全部损失。 三、商户的声明与保证 （一）其符合微店网招商标准，且向微店网提供真实、合法、准确、有效的注册资料，并保 证其诸如电子邮件地址、联系电话、联系地址、邮政编码等内容的有效性及安全性，保证微店网及其他用户可以通过上述联系方式与自己进行联系</p>
        </div>
    </div>
</template>

<script>
  export default {
    name: 'we-shop-agreement'
  }
</script>

<style lang="less" scoped>
    h2 {
        font-size: 16px;
        color: #333333;
        line-height: 16px;
        margin: 20px 0;
        text-align: center;
    }

    .con {
        padding: 0 15px 15px;
        font-size: 12px;
        color: #666666;
        line-height: 22px;
    }

    h3 {
        font-size: 13px;
        color: #151515;
    }
</style>
